<?php

const FUNCTIONS_ALL = [
    [
        'ru' => 'антибиотик',
        'en' => '',
        'uk' => 'антибіотик',
    ],
    [
        'ru' => 'антиокислитель',
        'en' => '',
        'uk' => 'антиокислювач',
    ],
    [
        'ru' => 'антислеживатель и антикомкователь',
        'en' => '',
        'uk' => 'антислежувач та антикомкувальник',
    ],
    [
        'ru' => 'ароматизатор',
        'en' => '',
        'uk' => 'ароматизатор',
    ],
    [
        'ru' => 'влагоудерживающее вещество',
        'en' => '',
        'uk' => 'вологоутримуюча речовина',
    ],
    [
        'ru' => 'газ для насыщения напитков',
        'en' => '',
        'uk' => 'газ для насичення напоїв',
    ],
    [
        'ru' => 'газовая среда для упаковки и хранения',
        'en' => '',
        'uk' => 'газове середовище для пакування та зберігання',
    ],
    [
        'ru' => 'глазирователь',
        'en' => '',
        'uk' => 'глазурувальник',
    ],
    [
        'ru' => 'диспергирующее вещество',
        'en' => '',
        'uk' => 'диспергуюча речовина',
    ],
    [
        'ru' => 'желеобразователь',
        'en' => '',
        'uk' => 'желеутворювач',
    ],
    [
        'ru' => 'загуститель',
        'en' => 'thickener',
        'uk' => 'загусник',
    ],
    [
        'ru' => 'комплексообразователь',
        'en' => '',
        'uk' => 'комплексоутворювач',
    ],
    [
        'ru' => 'консервант',
        'en' => '',
        'uk' => 'консервант',
    ],
    [
        'ru' => 'краситель',
        'en' => 'colour',
        'uk' => 'барвник',
    ],
    [
        'ru' => 'модификатор вкуса и аромата',
        'en' => '',
        'uk' => 'модифікатор смаку та аромату',
    ],
    [
        'ru' => 'наполнитель',
        'en' => '',
        'uk' => 'наповнювач',
    ],
    [
        'ru' => 'отбеливатель',
        'en' => '',
        'uk' => 'відбілювач',
    ],
    [
        'ru' => 'отвердитель',
        'en' => '',
        'uk' => 'затверджувач',
    ],
    [
        'ru' => 'оттеняющее вещество',
        'en' => '',
        'uk' => 'речовина, що відтіняє',
    ],
    [
        'ru' => 'пеногаситель',
        'en' => '',
        'uk' => 'піногасник',
    ],
    [
        'ru' => 'подсластитель',
        'en' => 'sweetener',
        'uk' => 'підсолоджувач',
    ],
    [
        'ru' => 'разделитель',
        'en' => '',
        'uk' => 'роздільник',
    ],
    [
        'ru' => 'разрыхлитель',
        'en' => '',
        'uk' => 'розпушувач',
    ],
    [
        'ru' => 'растворитель',
        'en' => '',
        'uk' => 'розчинник',
    ],
    [
        'ru' => 'регулятор кислотности',
        'en' => '',
        'uk' => 'регулятор кислотності',
    ],
    [
        'ru' => 'связывающее вещество',
        'en' => '',
        'uk' => 'зв\'язуюча речовина',
    ],
    [
        'ru' => 'синергист антиокислителя',
        'en' => '',
        'uk' => 'синергіст антиокислювача',
    ],
    [
        'ru' => 'стабилизатор',
        'en' => '',
        'uk' => 'стабілізатор',
    ],
    [
        'ru' => 'стабилизатор пены',
        'en' => '',
        'uk' => 'стабілізатор піни',
    ],
    [
        'ru' => 'стабилизатор цвета',
        'en' => '',
        'uk' => 'стабілізатор кольору',
    ],
    [
        'ru' => 'текстуратор',
        'en' => '',
        'uk' => 'текстуратор',
    ],
    [
        'ru' => 'увлажняющее вещество',
        'en' => '',
        'uk' => 'зволожуюча речовина',
    ],
    [
        'ru' => 'улучшитель муки и хлеба',
        'en' => '',
        'uk' => 'покращувач борошна та хліба',
    ],
    [
        'ru' => 'усилитель вкуса и аромата',
        'en' => '',
        'uk' => 'підсилювач смаку та аромату',
    ],
    [
        'ru' => 'ускоритель созревания мяса и рыбы',
        'en' => '',
        'uk' => 'прискорювач дозрівання м\'яса та риби',
    ],
    [
        'ru' => 'фиксатор цвета',
        'en' => '',
        'uk' => 'фіксатор кольору',
    ],
    [
        'ru' => 'эмульгатор',
        'en' => '',
        'uk' => 'емульгатор',
    ],
];
const SAFETY_ALL = [
        'green-mineral',
        'green-animal',
        'green-vegetable',
        'green-identical',
        'green-chemical',
        'green-microbiological',
        'yellow-mineral',
        'yellow-animal',
        'yellow-vegetable',
        'yellow-identical',
        'yellow-chemical',
        'yellow-microbiological',
        'orange-mineral',
        'orange-animal',
        'orange-vegetable',
        'orange-identical',
        'orange-chemical',
        'orange-microbiological',
        'red-mineral',
        'red-animal',
        'red-vegetable',
        'red-identical',
        'red-chemical',
        'red-microbiological',
];

